# -*- mode: org; mode: flyspell; ispell-local-dictionary: "hu" -*-
#+TITLE: Assembly

18+18 alkalom
* Áttekintés
** Első félév
| Hardver+szoftver        |  2 |
| Linux                   |  2 |
| bash                    |  2 |
| Szám ábrázolás          |  1 |
| CPU regiszterek memória |  3 |
| Paraméterek             |  1 |
| Fájl kezelés            |  2 |
| Összeadás kivonás       |  1 |
| Szorzás Osztás          |  2 |
| Ellenőrzők              |  2 |
|-------------------------+----|
|                         | 18 |
#+TBLFM: @>$2=vsum(@1$2..@-1$2)
** Második félév
| Elágazások és ciklusok    |  4 |
| Függvények                |  3 |
| Makrók                    |  2 |
| Linkelés                  |  1 |
| Beillesztés más nyelvekbe |  2 |
| Párhuzamos programozás    |  2 |
| Ellenőrzők                |  3 |
|---------------------------+----|
|                           | 17 |
#+TBLFM: @>$2=vsum(@1$2..@-1$2)
* TODO Ötletek 
** Endian
** Pipeline
** Vektor regiszterek
** Neumann elvű számítógépek
*** A program is adat
    - Program és adat is egy helyen tárolódik

* Hardver és szoftver 1-2
** [[file:3m-1-szgf.org][1 Számítógépek felépítése]]
** [[file:3m-2-os.org][2 Operációs rendszerek]]
* Linux 3-6
** 3 [[file:3m-3-linux.org][Linux elmélet]]
** 4 [[file:3m-4-linux-install.org][Linux telepítés]]
** 5 [[file:3m-5-bash.org][BASH]]
** 6 Bash parancsok
*** man
*** mkdir
*** cd
*** touch
*** echo
*** cat
*** sed
*** cut
*** tar
*** apt-get
*** gcc és g++
* Assembly 7-?
** 7 Assembly
*** yasm
*** "Hello world"
*** Szintaxis
*** Cimkék
** 8 Számábrázolás
*** Előjel nélküli egészek
*** Előjeles egészek
*** Lebegő pontos egyszeres pontosságú
*** Lebegő pontos dupla pontosságú 
** 9 ADD és SUB
** 10 MUL és DIV
** 11 CMP és Jxx
** 12 Elágazások és ciklusok
** 13 
** 14
** 15
** 16
** 17
** 18
** 19
** 20
** 21
** 22
** 23
** 24
** 25
** 26
** 27
** 28
** 29
** 30
** 31
** 32
** 33
** 34
** 35
** 36




